app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = 408
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'ded2d2' LIMIT 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 408
SELECT COUNT(*) FROM "posts" WHERE (created_at <= '2013-01-29 07:30:38.442897') AND ((title LIKE '%test%' OR body LIKE '%test%'))
---
              <% end %>
              <% if post.tag_list.size != 0 %>
                <li><span class="post-meta-label">Tags:</span> <%= raw post.tags.map { |t| link_to t.name, tag_path(t.name) }.join(', ') %></li>
              <% end %>
              <% if post.comments.count != 0 %>
              <li><span class="post-meta-label">Comments:</span> <%= link_to post.comments.count,  post %> Comments </li>