app/controllers/comments_controller.rb

	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.user = current_user
    @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "409-this-is-my-test"]]
INSERT INTO "comments" ("body", "created_at", "dislikes", "is_deleted", "likes", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"