app/controllers/posts_controller.rb

  def index
    seach_months_post
    if params[:tag]
      @posts = Post.tagged_with(params[:tag]).paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts" WHERE (created_at <= '2013-01-29 07:30:38.442897') AND ((title LIKE '%test%' OR body LIKE '%test%')) LIMIT 5 OFFSET 0
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = 408
SELECT COUNT(*) FROM "posts" WHERE (created_at <= '2013-01-29 07:30:38.442897') AND ((title LIKE '%test%' OR body LIKE '%test%'))

  def show
    seach_months_post
    @post = Post.find(params[:id])
    @comment_count = @post.comments.count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "408-how-dw"]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 408
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(params[:post])
    @post.user  = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "category", "created_at", "dislikes", "is_deleted", "is_published", "likes", "title", "total_comments", "updated_at", "user_id", "views") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"