app/views/common/_latest_post.html.erb

SELECT COUNT(*) FROM "posts"
---
<% if Post.order('created_at DESC').size != 0 %>

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5
---
      <h3 class="widget-title">Popular Tech</h3>
      <% Post.order('created_at DESC').limit(5).each do |post| %>